tap "homebrew/bundle"
brew "bat"
brew "btop"
brew "chezmoi"
brew "delve"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "gh"
brew "git-delta"
brew "git-flow"
brew "git-lfs"
brew "go"
brew "gopls"
brew "gum"
brew "jq"
brew "lazygit"
brew "lua"
brew "luarocks"
brew "mas"
brew "mysql-client"
brew "neofetch"
brew "neovim"
brew "nginx"
brew "node"
brew "protobuf"
brew "ripgrep"
brew "rust"
brew "starship"
brew "tree"
brew "zoxide"
brew "zsh"
cask "docker", args: { appdir: "/Applications" }
cask "font-fira-code"
cask "font-jetbrains-mono-nerd-font"
cask "fork"
cask "iina"
cask "visual-studio-code", args: { appdir: "/Applications" }
cask "wezterm"
mas "Telegram", id: 747648890
mas "Windows App", id: 1295203466
mas "微信", id: 836500024
vscode "entuent.fira-code-nerd-font"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "johnnymorganz.stylua"
vscode "narasimapandiyan.jetbrainsmono"
vscode "pkief.material-icon-theme"
vscode "sumneko.lua"
vscode "waderyan.gitblame"
