tap "bufbuild/buf"
tap "buo/cask-upgrade"
tap "craciuncezar/tap"
tap "homebrew/bundle"
tap "homebrew/cask", "https://mirrors.ustc.edu.cn/homebrew-cask.git"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions", "https://mirrors.ustc.edu.cn/homebrew-cask-versions.git"
tap "homebrew/command-not-found"
tap "homebrew/core", "https://mirrors.ustc.edu.cn/homebrew-core.git"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "mesca/luarocks"
tap "neovim/neovim"
tap "openresty/brew"
# General-purpose data compression with high compression ratio
brew "xz"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Companion library to apr, the Apache Portable Runtime library
brew "apr-util"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Automatically formats Python code to conform to the PEP 8 style guide
brew "autopep8"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU compiler collection
brew "gcc"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Emacs text editor
brew "emacs"
# Emacs dependency management
brew "cask"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Cross-platform make
brew "cmake"
# Reimplementation of ctags(1)
brew "ctags"
# Programmatically minimize files to isolate features of interest
brew "delta", link: false
# Pack, ship and run any application as a lightweight container
brew "docker"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# OpenType text shaping engine
brew "harfbuzz"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line outline and bitmap font editor/converter
brew "fontforge"
# Client app of fast reverse proxy to expose a local server to the internet
brew "frpc"
# Command-line fuzzy finder written in Go
brew "fzf"
# Disk usage analyzer with console interface written in Go
brew "gdu"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Extensions to follow Vincent Driessen's branching model
brew "git-flow"
# Git extension for versioning large files
brew "git-lfs"
# Render markdown on the CLI
brew "glow"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Database migrations CLI tool
brew "golangci-lint"
# Tool to list and diagnose Go processes currently running on your system
brew "gops"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Toolkit for creating graphical user interfaces
brew "gtk4"
# Tool for glamorous shell scripts
brew "gum"
# International Ispell
brew "ispell"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Terminal file manager
brew "lf"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Database of common MIME types
brew "shared-mime-info"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# Next-gen compiler infrastructure
brew "llvm"
# Powerful, lightweight programming language (v5.1.5)
brew "lua@5.1"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Package manager for the Lua programming language
brew "luarocks"
# Mac App Store command-line interface
brew "mas"
# Scalable distributed version control system
brew "mercurial"
# Pretty-print tabular data in Python
brew "python-tabulate"
# CLI for MySQL with auto-completion and syntax highlighting
brew "mycli"
# Fast, highly customisable system info script
brew "neofetch"
# HTTP/2 C Library
brew "nghttp2"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Platform built on V8 to build network applications
brew "node"
# Development kit for the Java programming language
brew "openjdk"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Highly capable, feature-rich programming language
brew "perl"
# Linter for prose
brew "proselint"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Pluggable linter and fixer to enforce Protocol Buffer style and conventions
brew "protolint"
# Emulator for x86 and PowerPC
brew "qemu"
# Generate types and converters from JSON, Schema, and GraphQL
brew "quicktype"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Format Rust code
brew "rustfmt"
# Rust toolchain installer
brew "rustup-init"
# Cross-shell prompt for astronauts
brew "starship"
# Opinionated Lua code formatter
brew "stylua"
# Version control system designed to be a better CVS
brew "subversion"
# Tool Command Language
brew "tcl-tk"
# User interface to the TELNET protocol
brew "telnet"
# NetBSD's FTP client
brew "tnftp"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# Naive linter for English prose
brew "write-good"
# Linter for YAML files
brew "yamllint"
# General-purpose lossless data-compression library
brew "zlib"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Additional completion definitions for zsh
brew "zsh-completions"
# A git command extension for switching git branches more efficiently.
brew "craciuncezar/tap/git-smart-checkout"
# Scalable Web Platform by Extending NGINX with Lua
brew "openresty/brew/openresty"
# Prebuilt OpenJDK binaries
cask "adoptopenjdk8"
# Enable Windows-like alt-tab
cask "alt-tab"
# Android SDK component
cask "android-platform-tools"
# Tools for building Android applications
cask "android-studio"
# Redis desktop manager
cask "another-redis-desktop-manager"
# Open links in any browser
cask "choosy"
# API documentation browser and code snippet manager
cask "dash"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
# Free monospaced font with programming ligatures
cask "font-fira-code"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Free and open-source media player
cask "iina"
# Collaboration platform for API development
cask "postman"
# System monitor for the menu bar
cask "stats"
# Desktop client for Telegram messenger
cask "telegram-desktop"
# Torrent streaming application
cask "webtorrent"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
mas "Bandizip", id: 1265704574
mas "ForkLift", id: 412448059
mas "HazeOver", id: 430798174
mas "Microsoft Remote Desktop", id: 1295203466
mas "QQ", id: 451108668
mas "Xcode", id: 497799835
mas "卸载助手", id: 1561724782
mas "微信", id: 836500024
mas "欧路词典", id: 434350458
mas "钉钉", id: 1435447041
vscode "Anan.jetbrains-darcula-theme"
vscode "asvetliakov.vscode-neovim"
vscode "bungcip.better-toml"
vscode "connor4312.esbuild-problem-matchers"
vscode "eamodio.gitlens"
vscode "golang.go"
vscode "huizhou.githd"
vscode "JohnnyMorganz.stylua"
vscode "ms-azuretools.vscode-docker"
vscode "MS-CEINTL.vscode-language-pack-zh-hans"
vscode "ms-dotnettools.csharp"
vscode "PKief.material-icon-theme"
vscode "qufiwefefwoyn.kanagawa"
vscode "rust-lang.rust-analyzer"
vscode "sumneko.lua"
vscode "Tobiah.unity-tools"
vscode "Unity.unity-debug"
vscode "vadimcn.vscode-lldb"
vscode "vscodevim.vim"
